# Устанавливаем базовый образ Python 3.11, чтобы использовать его в контейнере
FROM python:3.11

# Задаем рабочую директорию внутри контейнера, где будут находиться файлы приложения
WORKDIR /app

# Устанавливаем gunicorn— сервер, который будет обрабатывать запросы к приложению
RUN pip install gunicorn==23.0.0

COPY requirements.txt .

# Обновляем pip до последней версии
RUN python -m pip install --upgrade pip

# Устанавливаем зависимости приложения из файла requirements.txt без использования кэша
RUN pip install -r requirements.txt --no-cache-dir

# Копируем все файлы из текущей директории на локальной машине в рабочую директорию контейнера
COPY . .

# Запускаем сервер gunicorn, связывая его с портом 8080, и указываем конфигурационный файл WSGI
# CMD ["gunicorn", "--bind", "0.0.0.0:8080", "config.wsgi"]

# Увеличиваю количество воркеров
# --workers: количество процессов. Формула: (2 * количество_ядер_CPU) + 1. Начну с 2-3.
# --threads: количество потоков на один процесс. 2-4 потока на воркер — норм
#  Теперь один воркер сможет одновременно обрабатывать до 4 запросов.
#CMD ["gunicorn config.wsgi:application --workers 3 --threads 4 --bind 0.0.0.0:8080"]
CMD ["gunicorn", "config.wsgi:application", "--workers", "3", "--threads", "4", "--bind", "0.0.0.0:8080"]

