# Устанавливаем базовый образ Python 3.11, чтобы использовать его в контейнере
FROM python:3.11

# Задаем рабочую директорию внутри контейнера, где будут находиться файлы приложения
WORKDIR /app

# Устанавливаем gunicorn— сервер, который будет обрабатывать запросы к приложению
RUN pip install gunicorn==20.1.0

# Копируем все файлы из текущей директории на локальной машине в рабочую директорию контейнера
COPY . .

# Обновляем pip до последней версии
RUN python -m pip install --upgrade pip

# Устанавливаем зависимости приложения из файла requirements.txt без использования кэша
RUN pip install -r requirements.txt --no-cache-dir

# Запускаем сервер gunicorn, связывая его с портом 8080, и указываем конфигурационный файл WSGI
CMD ["gunicorn", "--bind", "0.0.0.0:8080", "config.wsgi"]